app/controllers/entrees_controller.rb

  def index
    @entrees = Entree.all
---
SELECT * FROM "entrees"

  def show
    @entree = Entree.find(params[:id])
---
SELECT * FROM "entrees" WHERE ("entrees"."id" = 1)

  def create
    @entree = Entree.new(params[:entree])

    respond_to do |format|
      if @entree.save
---
INSERT INTO "entrees" ("name", "description", "created_at", "updated_at") VALUES('Something Yummy', 'A big long description about the meal.', '2010-09-18 01:52:26', '2010-09-18 01:52:26')