app/controllers/home_controller.rb

  def index
    @meals = Meal.find(:all,:conditions =>{:published =>true}, :limit=>3)
---
SELECT * FROM "meals" WHERE ("meals"."published" = 't') LIMIT 3