app/controllers/meals_controller.rb

  def index
    @meals = Meal.all
---
SELECT * FROM "meals"

  def show
    @meal = Meal.find(params[:id])
---
SELECT * FROM "meals" WHERE ("meals"."id" = 1)

  def edit
    @meal = Meal.find(params[:id])
    @sides = Side.all
    @entrees = Entree.all
---
SELECT * FROM "meals" WHERE ("meals"."id" = 2)
SELECT * FROM "sides" WHERE ("sides".meal_id = 12)
SELECT * FROM "entrees" WHERE ("entrees".meal_id = 12)

  def create
    @meal = Meal.new(params[:meal])

    respond_to do |format|
      if @meal.save
---
INSERT INTO "meals" ("title", "side_title", "other_title", "day", "published", "created_at", "updated_at") VALUES('Meal One', 'Pick from these sides:', 'Your chose of salad', 'Tusday', 'f', '2010-09-18 02:34:00', '2010-09-18 02:34:00')

  def update
    @meal = Meal.find(params[:id])

    respond_to do |format|
      if @meal.update_attributes(params[:meal])
---
SELECT * FROM "meals" WHERE ("meals"."id" = 2)
UPDATE "meals" SET "day" = 'Thursday', "published" = 't', "updated_at" = '2010-10-05 02:06:33' WHERE "id" = 7

  def destroy
    @meal = Meal.find(params[:id])
    @meal.destroy
---
SELECT * FROM "meals" WHERE ("meals"."id" = 6)
DELETE FROM "meals" WHERE "id" = 6