app/controllers/sides_controller.rb

SELECT * FROM "sides"
---
  def index
    @sides = Side.all

SELECT * FROM "sides" WHERE ("sides"."id" = 1)
---
  def show
    @side = Side.find(params[:id])

SELECT * FROM "sides" WHERE ("sides"."id" = 5)
---
  def edit
    @side = Side.find(params[:id])

INSERT INTO "sides" ("description", "created_at", "updated_at") VALUES('Balslmic vinegrette', '2010-09-18 01:56:29', '2010-09-18 01:56:29')
---
  def create
    @side = Side.new(params[:side])

    respond_to do |format|
      if @side.save

SELECT * FROM "sides" WHERE ("sides"."id" = 5)
---
  def update
    @side = Side.find(params[:id])